<script setup lang="ts"></script>

<template>
  <div class="container">
    <div class="title">О компании</div>
    <div class="container-image">
      <div class="container-texts" style="margin-right: 20px">
        <p>
          Компания Zealcon была основана командой профессионалов с 15-летним
          опытом работы в логистике и внешней торговле.
        </p>
        <br />
        <p>
          Наша специализация - доставка разнообразных грузов из Европы и США на
          российский рынок, включая поставки товаров по параллельному импорту.
        </p>
        <br />
        <p>
          Мы понимаем, что каждый груз уникален, поэтому разрабатываем
          индивидуальные решения и оптимальные маршруты для каждого клиента.
        </p>
      </div>
      <img class="about-image" src="/about.png" />
    </div>
    <div class="line"></div>
    <div class="container-texts">
      <p>
        Наш опыт и экспертиза в международной логистике гарантируют высокое
        качество обслуживания и эффективное управление всеми этапами доставки.
        Мы являемся командой профессионалов, которая заботится обо всех аспектах
        вашей поставки - от организации транспорта и таможенного оформления до
        отслеживания груза и обработки документации.
      </p>
      <br />
      <p>
        Мы также предоставляем услуги параллельного импорта товаров. Мы поможем
        наладить параллельный импорт, если вам требуется приобрести товары,
        которые не поставляются правообладателями на российский рынок. Мы имеем
        широкую сеть поставщиков и партнеров, что позволяет нам доставить в
        Россию товары в рамках прямого и параллельного импорта из Европы и США.
      </p>
    </div>
    <div class="line"></div>
    <div class="container-texts">
      <p>
        Вы можете доверить нам закупку товаров в рамках прямого и параллельного
        импорта. Многолетний опыт работы с зарубежными контрагентами позволяет
        нам выгодно купить товары для импорта и доставить их в любой город
        России, включая Москву. Кроме того, наша команда экспертов знает все
        нюансы таможенного оформления импорта.
      </p>
      <br />
      <p>
        Вы можете доверить нам закупку товаров в рамках прямого и параллельного
        импорта. Многолетний опыт работы с зарубежными контрагентами позволяет
        нам выгодно купить товары для импорта и доставить их в любой город
        России, включая Москву. Кроме того, наша команда экспертов знает все
        нюансы таможенного оформления импорта.
      </p>
    </div>
    <div class="line"></div>
    <div class="container-texts">
      <p>
        Мы стремимся обеспечить первоклассный сервис для наших клиентов и
        предоставляем персонального менеджера, чтобы обеспечить информационную и
        оперативную поддержку на каждом этапе сотрудничества.
      </p>
      <br />
      <p>
        Наша цель - стать вашим надежным партнером в области логистики и помочь
        вам расширить ваш бизнес на российском рынке. С Zealcon Logistics вы
        можете быть уверены в качестве, надежности всех операций и своевременной
        доставке ваших грузов.
      </p>
      <br />
      <p>
        Свяжитесь с нами уже сегодня, и доверьте нам вашу логистику. Мы с
        нетерпением ждем возможности сотрудничества с вами!
      </p>
    </div>
  </div>
</template>

<style scoped>
.line {
  height: 1px;
  background: #cdcdcd;
  margin-bottom: 40px;
  margin-top: 48px;
}
.container-texts {
  font-size: 24px;
  font-weight: 300;
  color: #565656;
  line-height: 28px;
}
.container-texts:last-child {
  margin-bottom: 120px;
}
.container {
  padding-top: 140px;
  margin-left: 12%;
  margin-right: 12%;
}
.about-image {
  border-radius: 20px;
}
.container-image {
  display: flex;
}
.title {
  font-size: 40px;
  font-weight: 600;
  margin-bottom: 64px;
}
@media (max-width: 1400px) {
  .container-image {
    flex-direction: column;
  }
  .about-image {
    margin-top: 20px;
  }
}
@media (max-width: 900px) {
  .container-texts {
    font-size: 16px;
  }
  .title {
    margin-bottom: 32px;
  }
  .container {
    padding-top: 120px;
  }
}
</style>
